---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionAreaAndLineSymbolSpacing
source: html/41fe8298-38d8-759d-56ea-6f0fcf364170.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionAreaAndLineSymbolSpacing Property

Symbol spacing for boundary conditions.

## Syntax (C#)
```csharp
public double BoundaryConditionAreaAndLineSymbolSpacing { get; set; }
```